<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"be6caa88f3a92494046ec39e93ad6d98962a8c8b7b7d771f47d8d562e686f8c7","plan_job_ref":"Job Test plan target and replace #324 at https://github.com/dflook/terraform-github-actions/actions/runs/4336662943","plan_hash":"34f3626eac2f17fe3fe315e69880695d023605d181be16f4148d143bfb07b037","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "fkVbyEXGsg" -> (known after apply)
  ~ foreach = "0nPaj9cuon" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #324](https://github.com/dflook/terraform-github-actions/actions/runs/4336662943)